2D_micromodal/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.000035;

vertices        
(
    (0 0 0)
    (512 0 0)
    (512 512 0)
    (0 512 0)
    (0 0 5)
    (512 0 5)
    (512 512 5)
    (0 512 5)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (512 512 1) simpleGrading (1 1 1)
);

edges           
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }
    inlet
    {
		type patch;
		faces
		(
	    	(0 4 7 3)
		);
    } 
    outlet
    {
		type patch;
		faces
		(
	   	(1 2 6 5)
		);
    }
    frontandback
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
