2D_micromodal/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
phases (water oil);
water
{
	transportModel  Newtonian;
	nu              nu [ 0 2 -1 0 0 0 0 ] 1e-06;
	rho             rho [ 1 -3 0 0 0 0 0 ] 1000;
}


oil
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1.65e-5;
    rho             rho [ 1 -3 0 0 0 0 0 ] 864;
}

sigma        sigma [ 1 0 -2 0 0 0 0 ]   0.03;
