2D_micromodal/0_org/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet 
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    outlet 
    {
        type            zeroGradient;
    }

    solidwalls
    {
        type            constantAlphaContactAngle;
	limit		zeroGradient;
	theta0		contactAngle;
	value		uniform 0;
    }

    walls 
    {
        type            constantAlphaContactAngle;
        limit           zeroGradient;
        theta0          contactAngle;
        value           uniform 0;
    }


    frontandback
    {
        type            empty;
    }

}

// ************************************************************************* //
